tap "dart-lang/dart"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "ack"
brew "readline", link: true
brew "awscli"
brew "bash"
brew "bat"
brew "python@3.9"
brew "bazel"
brew "boost"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "colordiff"
brew "fontforge"
brew "gcc"
brew "gh"
brew "git"
brew "go"
brew "highlight"
brew "libusbmuxd"
brew "ideviceinstaller"
brew "ios-deploy"
brew "mercurial"
brew "minikube"
brew "node"
brew "premake"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "rlwrap"
brew "rust"
brew "swig"
brew "telnet"
brew "the_silver_searcher"
brew "watch"
brew "xcinfo"
brew "yarn"
brew "zsh"
brew "dart-lang/dart/dart"
cask "aerial"
cask "pusher"
vscode "aaron-bond.better-comments"
vscode "alefragnani.numbered-bookmarks"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "docsmsft.docs-markdown"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eg2.vscode-npm-script"
vscode "esbenp.prettier-vscode"
vscode "fernandoescolar.vscode-solution-explorer"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "HookyQR.beautify"
vscode "James-Yu.latex-workshop"
vscode "josetr.cmake-language-support-vscode"
vscode "Kasik96.swift"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.Theme-MarkdownKit"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "PsykoSoldi3r.itunes-vscode"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "rebornix.ruby"
vscode "sdras.night-owl"
vscode "stevencl.addDocComments"
vscode "streetsidesoftware.code-spell-checker"
vscode "toba.vsfire"
vscode "twxs.cmake"
vscode "Unity.unity-debug"
vscode "vscode-icons-team.vscode-icons"
vscode "WallabyJs.quokka-vscode"
vscode "wingrunr21.vscode-ruby"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
