tap "dart-lang/dart"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/services"
tap "teamookla/speedtest"
brew "ack"
brew "openssl@3"
brew "readline", link: true
brew "awscli"
brew "bash"
brew "bat"
brew "freetype"
brew "bazel"
brew "boost"
brew "cdecl"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "colordiff"
brew "direnv"
brew "docker"
brew "gcc"
brew "sdl2"
brew "ffmpeg"
brew "fontforge"
brew "gh"
brew "git"
brew "go"
brew "highlight"
brew "libusbmuxd"
brew "ideviceinstaller"
brew "imagemagick"
brew "ios-deploy"
brew "iperf3"
brew "mercurial"
brew "minikube"
brew "neovim"
brew "ninja"
brew "node"
brew "premake"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "python-tk@3.11"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "rlwrap"
brew "rust"
brew "swig"
brew "telnet"
brew "the_silver_searcher"
brew "tree"
brew "watch"
brew "xcinfo"
brew "yarn"
brew "zsh"
brew "dart-lang/dart/dart"
brew "teamookla/speedtest/speedtest", link: false
cask "dbeaver-community"
cask "google-cloud-sdk"
cask "pusher"
cask "sublime-text"
cask "warp"
vscode "aaron-bond.better-comments"
vscode "alefragnani.numbered-bookmarks"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "continue.continue"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "docsmsft.docs-markdown"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fernandoescolar.vscode-solution-explorer"
vscode "figma.figma-vscode-extension"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "hookyqr.beautify"
vscode "james-yu.latex-workshop"
vscode "josetr.cmake-language-support-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.theme-markdownkit"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "psykosoldi3r.itunes-vscode"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "toba.vsfire"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscode-icons-team.vscode-icons"
vscode "wallabyjs.quokka-vscode"
vscode "wingrunr21.vscode-ruby"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
