tap "dart-lang/dart"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kardolus/chatgpt-cli"
tap "oven-sh/bun"
tap "teamookla/speedtest"
brew "ack"
brew "openssl@3"
brew "readline", link: true
brew "awscli"
brew "bash"
brew "bat"
brew "freetype"
brew "bazel"
brew "boost"
brew "ghc"
brew "cabal-install"
brew "cdecl"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "colordiff"
brew "direnv"
brew "docker"
brew "eza"
brew "sdl2"
brew "ffmpeg"
brew "fontforge"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghcup"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "icu4c@76"
brew "gradle"
brew "haskell-stack"
brew "highlight"
brew "hlint"
brew "libusbmuxd"
brew "ideviceinstaller"
brew "imagemagick"
brew "ios-deploy"
brew "iperf3"
brew "kotlin"
brew "mercurial"
brew "minikube"
brew "neovim"
brew "ninja"
brew "node"
brew "pinentry-mac"
brew "pkgconf"
brew "pnpm"
brew "powerlevel10k"
brew "premake"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "python-tk@3.11"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "rlwrap"
brew "rust"
brew "swig"
brew "telnet"
brew "the_silver_searcher"
brew "tree"
brew "watch"
brew "xcinfo"
brew "yarn"
brew "zig"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "dart-lang/dart/dart"
brew "kardolus/chatgpt-cli/chatgpt-cli"
brew "oven-sh/bun/bun"
brew "teamookla/speedtest/speedtest", link: false
cask "dbeaver-community"
cask "github-copilot-for-xcode"
cask "google-cloud-sdk"
cask "pusher"
cask "sublime-text"
cask "warp"
vscode "aaron-bond.better-comments"
vscode "alefragnani.numbered-bookmarks"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "continue.continue"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "docsmsft.docs-markdown"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "hoovercj.haskell-linter"
vscode "humao.rest-client"
vscode "jacano.vscode-pnpm"
vscode "james-yu.latex-workshop"
vscode "josetr.cmake-language-support-vscode"
vscode "justusadam.language-haskell"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.theme-markdownkit"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mylesmurphy.prettify-ts"
vscode "openai.openai-chatgpt-adhoc"
vscode "p42ai.refactor"
vscode "phoityne.phoityne-vscode"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "psykosoldi3r.itunes-vscode"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "sdras.night-owl"
vscode "shopify.ruby-lsp"
vscode "shyykoserhiy.vscode-spotify"
vscode "streetsidesoftware.code-spell-checker"
vscode "toba.vsfire"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "wallabyjs.quokka-vscode"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
